In [1]:
import pandas as pd

In [13]:
df=pd.DataFrame({"a":[5,10,13,7,8,20,17,42],"b":[1,23,4,32,32,12,56,9],"c":[3,2,76,5,8,9,56,43]})
print("taille df:",df.shape)
df

taille df: (8, 3)

    a   b   c
0   5   1   3
1  10  23   2
2  13   4  76
3   7  32   5
4   8  32   8
5  20  12   9
6  17  56  56
7  42   9  43

In [14]:
dt=pd.DataFrame({"a":[5,13,7,17],"d":[2,1,53,3]})
print("taille dt:",dt.shape)
dt

taille dt: (4, 2)

    a   d
0   5   2
1  13   1
2   7  53
3  17   3

In [17]:
time=df[['a',"c"]]
time=time[time['a'].isin(dt['a'])]
time

    a   c
0   5   3
2  13  76
3   7   5
6  17  56

In [19]:
data=dt.merge(time, on='a')
data

    a   d   c
0   5   2   3
1  13   1  76
2   7  53   5
3  17   3  56

In [20]:
data1=pd.merge(dt,time, on='a')
data1

    a   d   c
0   5   2   3
1  13   1  76
2   7  53   5
3  17   3  56